[
    {
        "id": 1,
        "name": "Kafene",
        "slug": "kafene",
        "industry": "Finance",
        "challenge": "Kafene’s messaging was contingent on the promise that anyone could create an account and go as far as enabling payment in “in less than 5 minutes”. This meant that whatever software solution we built needed to be optimised for speed, and more importantly, the vendor’s onboarding process should be at most four minutes fifty-nine seconds long.",
        "services": [
            "Engineering",
            "Product - Merchant, Customer & Adminstrators Dashboard",
            "Team Lead"
        ],
        "technology": [
            "Vue",
            "Typescript",
            "Vuetify",
            "Storybook",
            "Vuex",
            "Pinia",
            "Node",
            "Express",
            "Postgres",
            "AWS",
            "Docker",
            "Kubernetes",
            "Jenkins",
            "Git",
            "Jira",
            "Confluence",
            "Slack"
        ],
        "quote": "Kafene wants you to enjoy the financial flexibility you deserve with affordable lease-to-own options for furniture, appliances, electronics, tires and wheels, and more - for nearly all credit ranges and price points.",
        "image": "https://res.cloudinary.com/michellead/image/upload/v1739502135/Rectangle_6_luwvqt.png",
        "url": "https://kafene.com",
        "job_description": [
            
                "Responsible for engineering 40% of new features on the admin, merchant and customer dashboards.",
                "Improved usability performance, and Fixed 90% of Kafene customer application bug issues.",
                "Created and maintained a new Kafene customer dashboard to design specifications.",
                "Improved Kafene admin dashboard performance and create new features using agile sprints.",
                "Maintained features across all applications that serves over 30,000 customers, merchants and admins.",
                "Collaborate and communicate with backend engineers to ensure seamless integration of frontend and backend functionalities.",
                "Review code from other engineers to help ensure security, maintainability and performance.",
                "Responsible for handling frontend codebases versioning with Git and Github.",
                "Led a team of 7 engineers to build the Kafene platform - Admin, Merchant & Customer dashboards.",
                "Scope task on task management board (JIRA, Pivotal Tracker) with Product managers and QA engineers."
            
        ]
    },
    {
        "id": 2,
        "name": "Patronize",
        "parent": "by piggyvest",
        "slug": "patronize",
        "industry": "Finance",
        "challenge": "A lot of businesses in Nigeria are out looking for alternative to traditional banks for their business money problem. Transfer or payments confirmation take a long time causing back and forth with customers or service consumers. Patronize is a solution to this problem.",
        "services": [
            "Engineering",
            "Marketing Website",
            "Product - Merchant Dashboard"
        ],
        "technology": [
            "React",
            "Redux",
            "Vue",
            "Typescript",
            "Storybook",
            "Git",
            "Slack",
            "Jest",
            "Vue Test Utils"
        ],
        "quote": "Patronize enables your business accept pocket app (fka as abeg) payments, helps you reach more customers and make more successful sales. The fastest bank transfer verification ever.",
        "image": "https://res.cloudinary.com/michellead/image/upload/v1739502135/Rectangle_6_1_ubsd64.png",
        "url": "https://patronize.co",
        "job_description": 
            [
                "Build Giveaway feature in patronize v1",
                "Build patronize storefront",
                "Built patronize marketing website",
                "Implement UX and UI flow of patronize v2",
                "Build Piggytech component library published all piggyvest product"
            ]
             
    },
    {
        "id": 3,
        "name": "TLScontact",
        "slug": "tlscontact",
        "industry": "Government - Visa and Consular Services",
        "challenge": "Government around the world are looking for a way to make international travel safe and easy for both governments and citizens. TLScontact is a solution to this problem.",
        "services": [
            "Engineering",
            "Product - Customer Dashboard",
            "Team Lead"
        ],
        "technology": [
            "Vue",
            "Veux",
            "Electron",
            "Java",
            "Python",
            "Aware",
            "Jest",
            "Git",
            "AWS",
            "Jira",
            "Confluence"
        ],
        "quote": "We make international travel safe and easy for both governments and citizens.",
        "image": "https://res.cloudinary.com/michellead/image/upload/v1739502135/Rectangle_6_2_u6hea9.png",
        "url": "https://www.tlscontact.com/en/",
        "job_description": [
            
                "Worked with UI/UX designers to implement the design system for TLScontact Biometrics solution.",
                "Built the TLScontact Biometrics solution from scratch.",
                "Meet with UKVI and TLScontact stakeholders to gather requirements for the TLScontact Biometrics solution and define product expectations.",
                "Built the TLScontact Documents self-upload UI.",
                "Write python scripts for file decryption and encryption workflows.",
                "Work with Engineering manager to define the product roadmap and feature prioritization on the frontend."
        ]
    },
    {
        "id": 4,
        "name": "Rigour",
        "slug": "rigour",
        "industry": "Health",
        "challenge": "The healthcare system in Nigeria/Africa, while resilient and vast, is riddled with inefficiencies and challenges that affect both public and private healthcare providers and patients.",
        "services": [
            "Engineering",
            "Leadership",
            "Product - Patient, Admin & Provider Dashboard"
        ],
        "technology": [
            "React",
            "React Query",
            "Typescript",
            "Storybook",
            "Jest",
            "Git",
            "Slack",
            "Clickup"
        ],
        "quote": "A healthcare management ecosystem designed to redefine the way healthcare is delivered, managed, and experienced in Nigeria & Africa.",
        "image": "https://res.cloudinary.com/michellead/image/upload/v1739502135/Rectangle_6_3_ohlvbe.png",
        "url": "https://www.rigourplus.com/",
        "job_description": [
            
                "Led a team of 5 engineers to build the Rigour OS platform - Patient, Admin & Provider dashboards.",
                "Worked with the product team to define the product roadmap and feature prioritization.",
                "Worked with UI/UX designers to implement the design system for the Rigour OS platform.",
                "Built the Rigour OS platform from scratch.",
                "Built the Rigour OS marketing website.",
                "Implement UX and UI flow of Rigour OS platform.",
                "Built component library published to npm for all Rigour OS product."
        ]
    }
]